Revit 2018 API
CustomExporter Methods
The CustomExporter type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Export(IList<ElementId>)
 Exports a collection of 3-D views
Export(View3D)
 Exports one 3-D view
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsRenderingSupported
 Checks if 3D view rendering is currently supported in the running instance of Revit.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace